import Figure1 from "../../images/test1.jpg";
import Figure2 from "../../images/test2.png";

const questions = [
    {
        "question": "Мигание светодиода на кнопке HEAT свидетельствует об:",
        "type": "single_choice",
        "options": [
            "Процессе нагрева КДЗС",
            "Процессе охлаждения КДЗС",
            "Окончании термоусадки",
            "Процессе сварки"
        ],
        "answer": [
            1
        ]
    },
    {
        "question": "Причины дефекта типа \"утолщение\"",
        "type": "multiple_choices",
        "options": [
            "Недостаточная величина сближения ОВ",
            "Большая мощность дуги",
            "Откололся край ОВ",
            "Большая величина сжатия ОВ"
        ],
        "answer": [
            2,
            3
        ]
    },
    {
        "question": "Какое положение переключателя питания соответствует питанию от сети переменного тока",
        "type": "single_choice",
        "options": [
            "AC",
            "DC",
            "Среднее",
            "Любое"
        ],
        "answer": [
            0
        ]
    },
    {
        "question": "Если перед началом сварки на экране не появляется сообщение \"ГОТОВ\", необходимо:",
        "type": "single_choice",
        "options": [
            "Нажать кнопку RESET",
            "Открыть и закрыть защитную крышку",
            "Выключить аппарат",
            "Нажать кнопку SET"
        ],
        "answer": [
            0
        ]
    },
    {
        "question": "Назначение кнопки 39",
        "type": "single_choice",
        figure: Figure2,
        "options": [
            "Движение волокна по оси X",
            "Движение волокна по оси Y",
            "Смена проекций ОВ",
            "Передвижение по пунктам меню"
        ],
        "answer": [
            3
        ]
    },
    {
        "question": "Какая кнопка управления используется для начала сварки",
        "type": "single_choice",
        "options": [
            "ARC",
            "RESET",
            "SET",
            "HEAT"
        ],
        "answer": [
            2
        ]
    },
    {
        "question": "Назначение кнопки X/Y",
        "type": "single_choice",
        "options": [
            "Движение волокна по оси X",
            "Движение волокна по оси Y",
            "Смена проекций ОВ",
            "Выбор дополнительных функций в меню"
        ],
        "answer": [
            2
        ]
    },
    {
        "question": "По оконачании сварки необходимо:",
        "type": "multiple_choices",
        "options": [
            "Дождаться звукового сигнала об окончании тестирования ОВ на разрыв",
            "Открыть зажимы оптических волокон",
            "Открыть защитную крышку",
            "Нажать кнопку RESET"
        ],
        "answer": [
            0,
            1,
            2
        ]
    },
    {
        "question": "Какое волокно можно сваривать в режиме MM?",
        "type": "multiple_choices",
        "options": [
            "ОВ легированное эрбием",
            "Одномодовое",
            "Волокно со смещенной дисперсией",
            "Многомодовое"
        ],
        "answer": [
            3
        ]
    },
    {
        "question": "Причины дефекта типа \"пузырь\":",
        "type": "multiple_choices",
        "options": [
            "Недостаточная величина сближения ОВ",
            "Большая мощность дуги",
            "Откололся край ОВ",
            "Плохой конец ОВ"
        ],
        "answer": [
            2,
            3
        ]
    },
    {
        "question": "Если на ОВ визуально видна грязь, необходимо:",
        "type": "single_choice",
        "options": [
            "Нажать кнопку RESET и заново подготовить ОВ",
            "Продолжить сварку",
            "Нажать кнопку SET",
            "Нажать кнопку ARC"
        ],
        "answer": [
            0
        ]
    },
    {
        "question": "Причины дефекта типа \"разрыв\":",
        "type": "multiple_choices",
        "options": [
            "Недостаточная величина сближения ОВ",
            "Большая мощность дуги",
            "Откололся край ОВ",
            "Плохой конец ОВ"
        ],
        "answer": [
            0,
            1
        ]
    },
    {
        "question": "Какая кнопка управления используется для включения печки?",
        "type": "single_choice",
        "options": [
            "SET",
            "HEAT",
            "RESET",
            "ARC"
        ],
        "answer": [
            1
        ]
    },
    {
        "question": "Какая кнопка управления используется для повторной сварки?",
        "type": "single_choice",
        "options": [
            "SET",
            "HEAT",
            "RESET",
            "ARC"
        ],
        "answer": [
            3
        ]
    },
    {
        "question": "Какая кнопка управления используется для выхода из состояния паузы?",
        "type": "single_choice",
        "options": [
            "SET",
            "HEAT",
            "RESET",
            "ARC"
        ],
        "answer": [
            0
        ]
    },
    {
        "question": "Какие ОВ можно сваривать сварочным аппаратом?",
        "type": "multiple_choices",
        "options": [
            "MM",
            "SM",
            "DS",
            "ED"
        ],
        "answer": [
            0,
            1,
            2,
            3
        ]
    },
    {
        "question": "Непрерывное горение светодиода на кнопке HEAT свидетельствует об:",
        "type": "single_choice",
        "options": [
            "Окончании термоусадки",
            "Процессе охлаждения КДЗС",
            "Процессе сварки",
            "Процессе нагрева КДЗС"
        ],
        "answer": [
            3
        ]
    },
    {
        "question": "Что обозначает цифра 60 внизу экрана?",
        "figure": Figure1,
        "type": "single_choice",
        "options": [
            "Температуру печки",
            "Время усадки КДЗС",
            "Длину КДЗС, мм",
            "Время сварки"
        ],
        "answer": [
            2
        ]
    },
    {
        "question": "Какую кнопку необходимо нажать для продолжения сварки при выходе из состояния паузы?",
        "type": "single_choice",
        "options": [
            "RESET",
            "SET",
            "ARC",
            "MENU"
        ],
        "answer": [
            1
        ]
    },
    {
        "question": "Какова номинальная длина зачистки ОВ, мм?",
        "type": "single_choice",
        "options": [
            "8-16",
            "10-18",
            "6-14",
            "12-20"
        ],
        "answer": [
            0
        ]
    },
    {
        "question": "Какая кнопка управления используется для установки системы в исходное состояние?",
        "type": "single_choice",
        "options": [
            "RESET",
            "SET",
            "HEAT",
            "ARC"
        ],
        "answer": [
            0
        ]
    },
    {
        "question": "Какое ОВ можно сваривать в режиме DS?",
        "type": "multiple_choices",
        "options": [
            "Многомодовое",
            "Одномодовое",
            "ОВ со смещенной дисперсией",
            "ОВ легированное эрбием"
        ],
        "answer": [
            2
        ]
    },
    {
        "question": "Причины дефекта типа \"утоньшение\"",
        "type": "multiple_choices",
        "options": [
            "Большая мощность дуги",
            "Плохой конец ОВ",
            "Загрязнение электродов",
            "Включена функция вытягивания"
        ],
        "answer": [
            0,
            3
        ]
    },
    {
        "question": "При сварке каких ОВ используется юстировка по сердцевине",
        "type": "multiple_choices",
        "options": [
            "SM",
            "MM",
            "DS",
            "ED"
        ],
        "answer": [
            0,
            2,
            3
        ]
    },
    {
        "question": "Что означают надписи в центре экрана?",
        "type": "single_choice",
        "figure": Figure1,
        "options": [
            "Возможные дальнейшие действия",
            "Последовательность нажатия кнопок",
            "Аппарат в состоянии ПАУЗА и возможные дальнейшие действия",
            "Последовательность нажатий кнопок после паузы"
        ],
        "answer": [
            0,
            2
        ]
    },
    {
        "question": "Назначение кнопок < и >",
        "type": "single_choice",
        "options": [
            "Смена проекций ОВ",
            "Смена позиций букв в комментариях",
            "Движение ОВ по оси X",
            "Движение ОВ по оси Y"
        ],
        "answer": [
            1
        ]
    },
    {
        "question": "Назначение кнопки ENT",
        "type": "single_choice",
        "options": [
            "Сварка ОВ",
            "Сброс системы",
            "Нагрев КДЗС",
            "Выбор пункта меню"
        ],
        "answer": [
            3
        ]
    },
    {
        "question": "Если на экране появляется ошибка о загрязнении зеркала, необходимо:",
        "type": "single_choice",
        "options": [
            "Продуть зеркала",
            "Прочистить зеркала ватной палочкой, смоченной в спирте",
            "Прочистить зеркала безворсовой салфектой, смоченной в спирте"
        ],
        "answer": [
            2
        ]
    },
    {
        "question": "Какое ОВ можно сваривать в режиме ED?",
        "type": "multiple_choices",
        "options": [
            "ОВ легированное эрбием",
            "Многомодовое",
            "Одномодовое",
            "ОВ со смещенной дисперсией"
        ],
        "answer": [
            0
        ]
    },
    {
        "question": "Указать верную последовательность выполнения операций:",
        "type": "single_choice",
        "options": [
            "Включение питания, выбор режима работы, зачистка ОВ, скол ОВ, одевание КДЗС",
            "Включение питания, выбор режима работы, одевание КДЗС, зачистка ОВ, скол ОВ",
            "Включение питания, выбор режима работы, одевание КДЗС, скол ОВ, зачистка ОВ",
            "Включение питания, выбор режима работы, зачистка ОВ, одевание КДЗС, скол ОВ"
        ],
        "answer": [
            1
        ]
    },
    {
        "question": "Какие потери в соединении могут быть допущены при сварке?",
        "type": "single_choice",
        "options": [
            "до 0,05 дБ",
            "до 0,5 дБ",
            "до 0,1 дБ",
            "до 0,01 дБ"
        ],
        "answer": [
            0
        ]
    },
    {
        "question": "Какое ОВ можно сваривать в режиме SM?",
        "type": "multiple_choices",
        "options": [
            "ОВ легированное эрбием",
            "Многомодовое",
            "Одномодовое",
            "ОВ со смещенной дисперсией"
        ],
        "answer": [
            2
        ]
    },
    {
        "question": "Если потери после сварки больше нормы, необходимо:",
        "type": "single_choice",
        "options": [
            "Полностью переделать сварку",
            "Нажать кнопку RESET и сбросить систему",
            "Произвести повторную сварку, кнопка SET",
            "Произвести повторную сварку, кнопка ARC"
        ],
        "answer": [
            0
        ]
    },
    {
        "question": "При сварке каких ОВ используется юстировка по оболочке?",
        "type": "multiple_choices",
        "options": [
            "SM",
            "MM",
            "DS",
            "ED"
        ],
        "answer": [
            1
        ]
    },
    {
        "question": "Какие виды юстировки применяются в сварочном аппарате Fujikura FSM-30S",
        "type": "multiple_choices",
        "options": [
            "PAS", "LID", "С помощью V-образной канавки", "CDS"
        ],
        "answer": [0, 2]
    },
    {
        "question": "Какой способ юстировки является самым простым?",
        "type": "single_choice",
        "options": ["С помощью V-образной канавки", "PAS", "LID", "CDS"],
        "answer": [0]
    }
];
export default questions;
